Ran Plan for dir: `ec2-jenkins` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=309950511952]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web will be created
+ resource "aws_instance" "web" {
      + ami                                  = "ami-01080f355d46c5b59"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "key-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all                             = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "82e151db147714f5445213eea89b03690ae6eaa5"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.jenkins_igw will be created
+ resource "aws_internet_gateway" "jenkins_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.kp will be created
+ resource "aws_key_pair" "kp" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "key-key"
      + key_pair_id = (known after apply)
      + public_key  = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_route.jenkins_routetointernet will be created
+ resource "aws_route" "jenkins_routetointernet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.jenkins_rt will be created
+ resource "aws_route_table" "jenkins_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all         = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.jenkins_pub_association will be created
+ resource "aws_route_table_association" "jenkins_pub_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ssh_jenkins will be created
+ resource "aws_security_group" "ssh_jenkins" {
      + arn                    = (known after apply)
      + description            = "Permite SSH e 8080 na EC2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH to EC2"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "jenkins to EC2"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "permitir_ssh_jenkins"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all               = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.jenkins_public_subnet will be created
+ resource "aws_subnet" "jenkins_public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "50.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all                        = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.jenkins_vpc will be created
+ resource "aws_vpc" "jenkins_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "50.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
      + tags_all                         = {
          + "Managed_by" = "Terraform"
          + "Name"       = "Jenkins"
        }
    }

  # local_file.ssh_key will be created
+ resource "local_file" "ssh_key" {
      + content              = (sensitive)
      + directory_permission = "700"
      + file_permission      = "400"
      + filename             = "./keys/key-key.pem"
      + id                   = (known after apply)
    }

  # tls_private_key.pk will be created
+ resource "tls_private_key" "pk" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ami        = "ami-01080f355d46c5b59"
+ arn        = (known after apply)
+ id         = (known after apply)
+ public-dns = (known after apply)
+ ssh_key    = "key-key"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.patomagico.com.br/lock?id=antoniocivc%252Fprojeto-padawan%252Fec2-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2-jenkins -- -var=key_name=key-key`
</details>
Plan: 11 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
